cassettes/akamai_api_eccu_publish/invalid_credentials.yml

---
http_interactions:
- request:
    method: post
    uri: https://USERNAME:PASSWORD@control.akamai.com/webservices/services/PublishECCU
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:akapubeccudt="https://control.akamai.com/2003/Sep/PublishECCU.xsd" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="https://control.akamai.com/AWS.xsd" xmlns:ins1="https://control.akamai.com/Publish.xsd"><env:Body><akapubeccudt:upload><filename xsi:type="xsd:string">./publish.xml</filename><contents xsi:type="xsd:base64Binary">PD94bWwgdmVyc2lvbj0iMS4wIj8+CjxlY2N1PgogIDxtYXRjaDpyZWN1cnNp
        dmUtZGlycyB2YWx1ZT0iZm9vIiA+CiAgICA8bWF0Y2g6cmVjdXJzaXZlLWRp
        cnMgdmFsdWU9ImJhciIgPgogICAgICA8bWF0Y2g6cmVjdXJzaXZlLWRpcnMg
        dmFsdWU9ImJhei5qcGciID4KICAgICAgICA8cmV2YWxpZGF0ZT5ub3c8L3Jl
        dmFsaWRhdGU+CiAgICAgIDwvbWF0Y2g6cmVjdXJzaXZlLWRpcnM+CiAgICA8
        L21hdGNoOnJlY3Vyc2l2ZS1kaXJzPgogIDwvbWF0Y2g6cmVjdXJzaXZlLWRp
        cnM+CjwvZWNjdT4=
        </contents><notes xsi:type="xsd:string">ECCU Request using AkamaiApi VERSION</notes><versionString xsi:type="xsd:string"></versionString><propertyName xsi:type="xsd:string">foo.com</propertyName><propertyType xsi:type="xsd:string">hostheader</propertyType><propertyNameExactMatch xsi:type="xsd:boolean">true</propertyNameExactMatch></akapubeccudt:upload></env:Body></env:Envelope>
    headers:
      Soapaction:
      - '"upload"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '1205'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 401
      message: Unauthorized
    headers:
      Server:
      - Apache
      Www-Authenticate:
      - Basic realm="Luna Control Center Web Services (use your Luna username and
        password)"
      Content-Length:
      - '401'
      Content-Type:
      - text/html; charset=iso-8859-1
      Expires:
      - Mon, 26 May 2014 08:05:03 GMT
      Cache-Control:
      - max-age=0, no-cache, no-store
      Pragma:
      - no-cache
      Date:
      - Mon, 26 May 2014 08:05:03 GMT
      Connection:
      - close
      X-Frame-Options:
      - SAMEORIGIN
    body:
      encoding: UTF-8
      string: |
        <!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML 2.0//EN">
        <html><head>
        <title>401 Authorization Required</title>
        </head><body>
        <h1>Authorization Required</h1>
        <p>This server could not verify that you
        are authorized to access the document
        requested.  Either you supplied the wrong
        credentials (e.g., bad password), or your
        browser doesn't understand how to supply
        the credentials required.</p>
        </body></html>
    http_version:
  recorded_at: Mon, 26 May 2014 08:05:03 GMT
recorded_with: VCR 2.9.0
