cassettes/akamai_api_eccu_find/invalid_credentials.yml

---
http_interactions:
- request:
    method: post
    uri: https://control.akamai.com/webservices/services/PublishECCU
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:akapubeccudt="https://control.akamai.com/2003/Sep/PublishECCU.xsd"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="https://control.akamai.com/AWS.xsd"
        xmlns:ins1="https://control.akamai.com/Publish.xsd"><env:Body><akapubeccudt:getInfo><fileId
        xsi:type="xsd:int">1234</fileId><retrieveContents xsi:type="xsd:boolean">true</retrieveContents></akapubeccudt:getInfo></env:Body></env:Envelope>
    headers:
      Soapaction:
      - '"getInfo"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '563'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
      Authorization:
      - Basic Zm9vOmJhcg==
  response:
    status:
      code: 401
      message: Unauthorized
    headers:
      Www-Authenticate:
      - Basic realm="Luna Control Center Web Services (use your Luna username and
        password)"
      Content-Length:
      - '401'
      Content-Type:
      - text/html; charset=iso-8859-1
      Expires:
      - Thu, 02 Mar 2017 05:48:42 GMT
      Cache-Control:
      - max-age=0, no-cache, no-store
      Pragma:
      - no-cache
      Date:
      - Thu, 02 Mar 2017 05:48:42 GMT
      Connection:
      - close
      Strict-Transport-Security:
      - max-age=15552000
      X-Frame-Options:
      - SAMEORIGIN
    body:
      encoding: UTF-8
      string: |
        <!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML 2.0//EN">
        <html><head>
        <title>401 Authorization Required</title>
        </head><body>
        <h1>Authorization Required</h1>
        <p>This server could not verify that you
        are authorized to access the document
        requested.  Either you supplied the wrong
        credentials (e.g., bad password), or your
        browser doesn't understand how to supply
        the credentials required.</p>
        </body></html>
    http_version: 
  recorded_at: Thu, 02 Mar 2017 05:48:42 GMT
recorded_with: VCR 3.0.3
